
// Напишите программу, которая принимает на вход
// трёхзначное число и на выходе показывает последнюю цифру
// этого числа.


/*Console.Write("Введите трехзначное число: ");
int number = Convert.ToInt32(Console.ReadLine());

int i = number % 10;

Console.WriteLine($" Последняя цифра введенного числа равна {i}");*/

// Напишите программу, которая на вход принимает
// одно число (N), а на выходе показывает все целые
// числа в промежутке от -N до N.








